19-rails-forms/app/controllers/trains_controller.rb

SELECT "drivers".* FROM "drivers"
---
  def new
    @train = Train.new
    @drivers = Driver.all

INSERT INTO "trains" ("destination", "time", "driver_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["destination", "LA"], ["time", 12], ["driver_id", 3], ["created_at", "2019-10-15 15:11:30.435080"], ["updated_at", "2019-10-15 15:11:30.435080"]]
---
  def create
    @train = Train.create(trains_params)

SELECT "drivers".* FROM "drivers"
---
  def edit
    # @train = Train.find(params[:id])
    @drivers = Driver.all

UPDATE "trains" SET "driver_id" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["driver_id", 2], ["updated_at", "2019-10-15 15:14:36.635579"], ["id", 6]]
---
  def update
    # byebug
    # @train = Train.find(params[:id])
    @train.update(trains_params)

DELETE FROM "trains" WHERE "trains"."id" = ?  [["id", 9]]
---
  def destroy
    # byebug
    # train = Train.find(params[:id])
    @train.destroy

SELECT "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def current_train
    @train = Train.find(params[:id])