20-rails-one-many/app/controllers/trains_controller.rb

  def index
    @trains = Train.all
---
SELECT "trains".* FROM "trains"

  def new
    @train = Train.new
    @drivers = Driver.all
---
SELECT "drivers".* FROM "drivers"

  def create
    # byebug
    @train = Train.create(trains_params)
---
INSERT INTO "trains" ("destination", "time", "driver_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["destination", "SF"], ["time", 18], ["driver_id", 3], ["created_at", "2019-10-15 15:09:15.437306"], ["updated_at", "2019-10-15 15:09:15.437306"]]

  def edit
    # @train = Train.find(params[:id])
    @drivers = Driver.all
---
SELECT "drivers".* FROM "drivers"

  def update
    # byebug
    # @train = Train.find(params[:id])
    @train.update(trains_params)
---
UPDATE "trains" SET "driver_id" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["driver_id", 2], ["updated_at", "2019-10-15 15:13:06.993819"], ["id", 6]]

  def destroy
    # byebug
    # train = Train.find(params[:id])
    @train.destroy
---
DELETE FROM "trains" WHERE "trains"."id" = ?  [["id", 9]]

  def current_train
    @train = Train.find(params[:id])
---
SELECT "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]