21-rails-many-many/app/controllers/customers_controller.rb

  def new
    @customer = Customer.new
    @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def create
    byebug
    @customer = Customer.create(customers_params)
---
INSERT INTO "customers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Chandon"], ["created_at", "2019-10-15 16:37:58.914628"], ["updated_at", "2019-10-15 16:37:58.914628"]]

  def edit
    @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def current_customer
    @customer = Customer.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]