18-rails-Intro/app/controllers/trains_controller.rb

SELECT "trains".* FROM "trains"
---
  def index
    @trains = Train.all

SELECT "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @train = Train.find(params[:id])

SELECT "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "trains" WHERE "trains"."id" = ?  [["id", 2]]
---
  def destroy
    # byebug
    train = Train.find(params[:id])
    train.destroy