23-rails-review/app/controllers/instructors_controller.rb

SELECT "instructors".* FROM "instructors"
---
    def index
        @instructors = Instructor.all

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def show
        @instructor = Instructor.find(params[:id])

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def edit
        @instructor = Instructor.find(params[:id])

INSERT INTO "instructors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "bill"], ["created_at", "2019-10-17 22:06:26.717061"], ["updated_at", "2019-10-17 22:06:26.717061"]]
---
    def create
        @instructor = Instructor.new(instructor_params)
        if @instructor.valid?
            @instructor.save

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "instructors" SET "name" = ?, "updated_at" = ? WHERE "instructors"."id" = ?  [["name", "josieeeeeee"], ["updated_at", "2019-10-17 22:23:40.707447"], ["id", 5]]
---
    def update
        @instructor = Instructor.find(params[:id])
        @instructor.update(instructor_params)

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "instructors" WHERE "instructors"."id" = ?  [["id", 4]]
---
    def destroy
        @instructor = Instructor.find(params[:id])
        @instructor.destroy