23-rails-review/app/controllers/students_controller.rb

SELECT "instructors".* FROM "instructors"
---
        def new
            @student = Student.new
            @instructors = Instructor.all

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
SELECT "instructors".* FROM "instructors"
---
        def edit
            @student = Student.find(params[:id])
            @instructors = Instructor.all

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
UPDATE "students" SET "age" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["age", 19], ["updated_at", "2019-10-17 22:51:37.753686"], ["id", 27]]
---
        def update
            @student = Student.find(params[:id])
            @student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 27]]
---
        def destroy
            @student = Student.find(params[:id])
            @student.destroy