21-rails-many-many/app/views/customers/show.html.erb

    Reviewed Restaurants:
    <% @customer.restaurants.each do |restaurant| %>
---
SELECT "restaurants".* FROM "restaurants" INNER JOIN "reviews" ON "restaurants"."id" = "reviews"."restaurant_id" WHERE "reviews"."customer_id" = ?  [["customer_id", 1]]