22-rails-validations/app/controllers/customers_controller.rb

  def new
    @customer = Customer.new
    @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def create
    @customer = Customer.new(customers_params)


    if @customer.valid?
        @customer.save
---
INSERT INTO "customers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Fernando"], ["created_at", "2019-10-16 15:17:45.475736"], ["updated_at", "2019-10-16 15:17:45.475736"]]

  def current_customer
    @customer = Customer.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]