22-rails-validations/app/controllers/customers_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
  def edit
    @restaurants = Restaurant.all